---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/5d6b9f6a-d25a-9766-009c-9379e4782dbd.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

Sets the attribute value.

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	IFCAnyHandle value
)
```

## Parameters
- **name** (`System.String`) - The attribute name.
- **value** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null